import { useState } from 'react'

import './style/index.css'

import Navbar from './Navbar'
import Footer from './Footer'
import Shop from './Shop'
import Piece from './Piece'
import SlideShow from './Slideshow'
import List from "./List"
import WhatsAppButton from "./WhatsappButton"
import Contact from "./contact"
import LangButton from "./LangButton";

function App() {

  const [darkMode, setDarkMode] = useState(true);
  const [buttonText, setButtonText] = useState("☀️");

  const [lang, setLang] = useState("ar"); // default Arabic

  const toggleLang = () => {
    setLang(prev => (prev === "ar" ? "en" : "ar"));
  };

  const languages = [
    "Arabic",
    "English",
    "Turkish",
    "French",
    "German",
    "Spanish",
    "Italian",
    "Russian",
    "Chinese",
    "Persian",
    "Dutch",
    "Swedish"
  ]

  const Services = [
    "ترجمة أي مستند قانوني إلى أي لغة",
    "نصيحة خبير الهجرة بشأن الحصول على الجنسية أو الوضع القانوني",
    "إفادات الترجمة",
    "إفادات الترجمة المعتمدة",
    "ترجمة مستندات القبول للجامعات والمدارس الثانوية",
    "ترجمة العقود الملزمة قانونياً بدقة عالية",
    "ترجمة الدعاوى المدنية والملفات القضائية",

    // شهادات قانونية
    "ترجمة شهادات الزواج",
    "ترجمة شهادات الطلاق",
    "ترجمة شهادات الوفاة",
    "ترجمة شهادات التدريب",
    "ترجمة الشهادات الأكاديمية",
    "ترجمة النصوص والسجلات الأكاديمية",
    "ترجمة شهادات الميلاد",

    // وثائق قانونية
    "ترجمة العقود والاتفاقيات",
    "ترجمة وثائق التقاضي ودعاوى المحكمة",
    "ترجمة التوكيلات القانونية",
    "ترجمة عقود التأسيس للشركات"
  ]

  return (
    <div className='App' data-theme={darkMode ? 'dark' : 'light'}>
      
      <Navbar></Navbar>

      <LangButton currentLang={lang} toggleLang={toggleLang} />
      
      <SlideShow></SlideShow>

      <button id='darkButton' onClick={() => setDarkMode(!darkMode)}>{ darkMode ? "🌙" : "☀️"}</button>

      <List Header="اللغات" languages={languages} />
      
      <Piece 
        Big="من نحن"
        Medium="رواد في جودة الترجمة القانونية المعتمدة.
نقدم خدمات ترجمة قانونية دقيقة ومعترف بها رسميًا لدى الجهات الحكومية والجامعات والمؤسسات القانونية حول العالم. يعمل لدينا فريق مترجمين قانونيين معتمدين بخبرة طويلة لضمان أعلى مستويات الدقة والاحترافية والسرية التامة لجميع الوثائق."
       ImagePath="tran1.png"
      />

      <Piece 
        Big="نبذة عن المكتب"
        Medium="خدمات ترجمة قانونية فائقة الجودة.يُعد مكتب المترجم القانوني من المكاتب الرائدة في الترجمة المعتمدة، حيث بنى سمعة قوية قائمة على الدقة والاحترافية والالتزام الكامل بالمعايير القانونية. يعمل لدينا فريق من المترجمين القانونيين المعتمدين لتقديم ترجمة متخصصة في المجالات القانونية والإدارية والأكاديمية، مع ضمان السرية التامة وسرعة التنفيذ وأسعار تنافسية للأفراد والمؤسسات.."
        image="tran2.jpg"
      />

      <Piece 
        Big="مترجم وثائق قانونية"
        Medium="الترجمة القانونية تتطلب خبرة عالية ومعرفة دقيقة بالمصطلحات القانونية بين الدول. يقوم مترجمونا المختصون بترجمة المستندات القانونية بلغتهم الأم لضمان أعلى درجات الدقة القانونية واللغوية، مع تسليم سريع وأسعار مناسبة."
        image="legal.jpg"
      />

      <Piece 
        Big="الترجمة القانونية المعتمدة"
        Medium="نقدم جميع أنواع خدمات الترجمة القانونية بأكثر من 100 لغة، بما في ذلك شهادات الميلاد، جوازات السفر، رخص القيادة، العقود، ووثائق المحاكم. جميع الترجمات معتمدة ومقبولة لدى الجهات الرسمية والمؤسسات الحكومية."
      />

      <List Header="خدماتنا" languages={Services} />

      <Contact></Contact>

      <Shop Name='Our shop'/>

      <Footer/>

      <WhatsAppButton /> {/* Always floating */}

    </div>
  )
}

export default App
